/*
11.如果不使用位段，你怎样实现下面这段代码的功能？假定你使用的是一台16位的机器，它从左向右为位段分配内存。
*/
struct {
    int a:4;
    int b:8;
    int c:3;
    int d:1;
} x;
//...
x.a = aaa;
x.b = bbb;
x.c = ccc;
x.d = ddd;

//先处理最左边 4 位
x &= 0x0fff; //最左边4位置空
x |= (aaa & 0xf) << 12;
// 再处理中间 8 位
x &= 0xf00f;
x |= (bbb & 0xff) << 4;
// 再处理接下来的 3 位, 0xfff0001
x &= 0xfff1;
x |= (ccc & 0x7) << 1;  // 0x7 位模式表示为 0111
// 最后处理最后 1 位, 1110 = 14 = e
x & = 0xfffe;
x |= (ddd & 0x1);

/*或者*/
x = aaa & 0xf;
x <<= 8;    //左移8位腾出空间用于存放成员b
x |= bbb & 0xff;
x <<= 3;    //左移3位腾出空间用于存放成员c
x |= ccc & 0x7;
x <<= 1;    //左移1位腾出空间用于存放成员d
x |= ddd & 0x1;